### 1. Importing pandas

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

### 2. Showing first 5 records

In [2]:
df = pd.read_csv('example.csv')
df.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"ALLISON, PAUL W",LIEUTENANT,FIRE,F,Salary,NaN,"$107,790.00",NaN
1,"BRUNO, KEVIN D",SERGEANT,POLICE,F,Salary,NaN,"$104,628.00",NaN
2,"COOPER, JOHN E",LIEUTENANT-EMT,FIRE,F,Salary,NaN,"$114,324.00",NaN
3,"CRESPO, VILMA I",STAFF ASST,LAW,F,Salary,NaN,"$76,932.00",NaN
4,"DOLAN, ROBERT J",SERGEANT,POLICE,F,Salary,NaN,"$111,474.00",NaN

In [3]:
df.sample(10)

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
20988,"NOE, MARTIN A",PLUMBING INSPECTOR,WATER MGMNT,F,Salary,NaN,"$102,510.00",NaN
18518,"MCDONALD IV, ROBERT J",POLICE OFFICER,POLICE,F,Salary,NaN,"$72,510.00",NaN
16698,"LIPKE, WILLIAM A",POLICE OFFICER,POLICE,F,Salary,NaN,"$87,006.00",NaN
25734,"SALGADO, CESAR",DIR OF INFORMATION SYSTEMS,STREETS & SAN,F,Salary,NaN,"$116,844.00",NaN
14682,"KAPPEL, DANIELLE M",POLICE OFFICER,POLICE,F,Salary,NaN,"$90,024.00",NaN
29903,"VALERIO, MAGDALENA",POLICE OFFICER,POLICE,F,Salary,NaN,"$87,006.00",NaN
10143,"GIES, JOHN C",CAPTAIN-EMT,FIRE,F,Salary,NaN,"$132,732.00",NaN
18980,"MEDENICA, BOGDAN",POLICE OFFICER,POLICE,F,Salary,NaN,"$90,024.00",NaN
1304,"BAGGETT, CRYSTAL",POLICE COMMUNICATIONS OPERATOR I,OEMC,F,Salary,NaN,"$47,592.00",NaN
19240,"MEYER, KENNETH J",FIRST DEPUTY COMMISSIONER,BUSINESS AFFAIRS,F,Salary,NaN,"$133,008.00",NaN

In [4]:
df.tail()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
32653,"ZYGOWICZ, PETER J",POLICE OFFICER,POLICE,F,Salary,NaN,"$90,024.00",NaN
32654,"ZYLINSKA, KATARZYNA",POLICE OFFICER,POLICE,F,Salary,NaN,"$48,078.00",NaN
32655,"ZYMANTAS, MARK E",POLICE OFFICER,POLICE,F,Salary,NaN,"$87,006.00",NaN
32656,"ZYRKOWSKI, CARLO E",POLICE OFFICER,POLICE,F,Salary,NaN,"$93,354.00",NaN
32657,"ZYSKOWSKI, DARIUSZ",CHIEF DATA BASE ANALYST,DoIT,F,Salary,NaN,"$115,932.00",NaN

In [5]:
#lets remove the dollar signs and commas
currency_cols = ['Annual Salary', 'Hourly Rate']

for col in currency_cols:
    df[col] = df[col].replace('[\$,]','', regex = True)

In [6]:
df = df.astype({'Typical Hours':np.float64,
                'Annual Salary':np.float64,
               'Hourly Rate':np.float64})

### 3. Overview of data

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32658 entries, 0 to 32657
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Name               32658 non-null  object
 1   Job Titles         32658 non-null  object
 2   Department         32658 non-null  object
 3   Full or Part-Time  32658 non-null  object
 4   Salary or Hourly   32658 non-null  object
 5   Typical Hours      7883 non-null   float64
 6   Annual Salary      24775 non-null  float64
 7   Hourly Rate        7883 non-null   float64
dtypes: float64(3), object(5)
memory usage: 2.0+ MB

### 4. How many 'NaN' `(missing values)` is in each column of the data

In [8]:
df.isnull().any()

Name                 False
Job Titles           False
Department           False
Full or Part-Time    False
Salary or Hourly     False
Typical Hours         True
Annual Salary         True
Hourly Rate           True
dtype: bool

so there are missing values in `Typical Hours`, `Annual Salary` and `Hourly Rate` columns

In [9]:
df.isnull().sum()

Name                     0
Job Titles               0
Department               0
Full or Part-Time        0
Salary or Hourly         0
Typical Hours        24775
Annual Salary         7883
Hourly Rate          24775
dtype: int64

### 5. Statistics of the dataset

In [10]:
df.describe()

       Typical Hours  Annual Salary  Hourly Rate
count    7883.000000   24775.000000  7883.000000
mean       34.698719   87512.780241    32.868192
std         9.145553   20563.723361    12.124440
min        10.000000       0.960000     2.650000
25%        20.000000   76932.000000    21.200000
50%        40.000000   90024.000000    35.600000
75%        40.000000   97368.000000    40.200000
max        40.000000  300000.000000    96.000000

In [11]:
df.describe(include = 'all')

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
count,32658,32658,32658,32658,32658,7883.000000,24775.000000,7883.000000
unique,32350,1095,36,2,2,NaN,NaN,NaN
top,"HERNANDEZ, JUAN C",POLICE OFFICER,POLICE,F,Salary,NaN,NaN,NaN
freq,5,9393,12973,30676,24775,NaN,NaN,NaN
mean,NaN,NaN,NaN,NaN,NaN,34.698719,87512.780241,32.868192
std,NaN,NaN,NaN,NaN,NaN,9.145553,20563.723361,12.124440
min,NaN,NaN,NaN,NaN,NaN,10.000000,0.960000,2.650000
25%,NaN,NaN,NaN,NaN,NaN,20.000000,76932.000000,21.200000
50%,NaN,NaN,NaN,NaN,NaN,40.000000,90024.000000,35.600000
75%,NaN,NaN,NaN,NaN,NaN,40.000000,97368.000000,40.200000
max,NaN,NaN,NaN,NaN,NaN,40.000000,300000.000000,96.000000

### 6. Minimum, maximum and average `Typical Hours`

In [12]:
print(f'Maximum typical hours: {df["Typical Hours"].max()}')
print(f'Minimum typical hours: {df["Typical Hours"].min()}')
print(f'Average typical hours: {df["Typical Hours"].mean():.2f}')

Maximum typical hours: 40.0
Minimum typical hours: 10.0
Average typical hours: 34.70

### 7. How many employees are on salary and how many are working on hourly basis?

In [13]:
df['Salary or Hourly'].unique()

array(['Salary', 'Hourly'], dtype=object)

In [14]:
df['Salary or Hourly'].value_counts()

Salary or Hourly
Salary    24775
Hourly     7883
Name: count, dtype: int64

### 8. Max no of employees

In [15]:
df.groupby(['Department'])['Name'].count().sort_values(ascending = False)

Department
POLICE                   12973
FIRE                      4800
STREETS & SAN             2194
OEMC                      2044
WATER MGMNT               1878
AVIATION                  1612
TRANSPORTN                1103
GENERAL SERVICES           972
PUBLIC LIBRARY             932
FAMILY & SUPPORT           621
FINANCE                    575
HEALTH                     516
LAW                        405
CITY COUNCIL               400
BUILDINGS                  266
COMMUNITY DEVELOPMENT      214
BUSINESS AFFAIRS           168
BOARD OF ELECTION          112
DoIT                       101
PROCUREMENT                 86
MAYOR'S OFFICE              85
CITY CLERK                  85
CULTURAL AFFAIRS            76
ANIMAL CONTRL               73
HUMAN RESOURCES             68
INSPECTOR GEN               63
IPRA                        56
BUDGET & MGMT               44
ADMIN HEARNG                38
DISABILITIES                29
TREASURER                   24
HUMAN RELATIONS             17
COPA                        17
BOARD OF ETHICS              8
POLICE BOARD                 2
LICENSE APPL COMM            1
Name: Name, dtype: int64

So `POLICE` department has the most no of employees

### 9. How many employees are on Salary and how many are on Hourly in the Police dept?

In [16]:
df[df['Department']=="POLICE"]['Salary or Hourly'].value_counts()

Salary or Hourly
Salary    12941
Hourly       32
Name: count, dtype: int64

### 10. What are the min, max and mean of the salaries?

In [17]:
print(f'Min salary: {df["Annual Salary"].min()}')
print(f'Max salary: {df["Annual Salary"].max()}')
print(f'Mean salary: {df["Annual Salary"].mean()}')

Min salary: 0.96
Max salary: 300000.0
Mean salary: 87512.78024137235

### 11. Employee with maximum salary

In [18]:
df[df['Annual Salary'] == df['Annual Salary'].max()]

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
8310,"EVANS, GINGER S",COMMISSIONER OF AVIATION,AVIATION,F,Salary,NaN,300000.0,NaN

In [27]:
#Alt
idx = df["Annual Salary"].idxmax()
df.loc[idx]

Name                         EVANS,  GINGER S
Job Titles           COMMISSIONER OF AVIATION
Department                           AVIATION
Full or Part-Time                           F
Salary or Hourly                       Salary
Typical Hours                             NaN
Annual Salary                        300000.0
Hourly Rate                               NaN
Name: 8310, dtype: object

### 12. Employee with minimum salary

In [20]:
df[df['Annual Salary'] == df['Annual Salary'].min()]

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
15387,"KOCH, STEVEN",ADMINISTRATIVE SECRETARY,MAYOR'S OFFICE,F,Salary,NaN,0.96,NaN

In [26]:
#Alt
idx = df["Annual Salary"].idxmin()
df.loc[idx]

Name                           KOCH,  STEVEN
Job Titles           ADMINISTRATIVE SECRETARY
Department                     MAYOR'S OFFICE
Full or Part-Time                           F
Salary or Hourly                       Salary
Typical Hours                             NaN
Annual Salary                            0.96
Hourly Rate                               NaN
Name: 15387, dtype: object

### 13. What are the mean, max and min Hourly Rate?

In [22]:
print(f"Mean Hourly Rate:{df['Hourly Rate'].mean():.2f}")
print(f"Max Hourly Rate:{df['Hourly Rate'].max()}")
print(f"Min Hourly Rate:{df['Hourly Rate'].min()}")

Mean Hourly Rate:32.87
Max Hourly Rate:96.0
Min Hourly Rate:2.65

### 14. How many employees are getting the max hourly rate?

In [23]:
df[df['Hourly Rate'] == df['Hourly Rate'].max()]['Name'].count()

1

### 15. Who is getting max Hourly Rate?

In [25]:
idx = df['Hourly Rate'].idxmax()
df.loc[idx]

Name                 JONES,  JOHN W
Job Titles             PSYCHIATRIST
Department                   HEALTH
Full or Part-Time                 F
Salary or Hourly             Hourly
Typical Hours                  35.0
Annual Salary                   NaN
Hourly Rate                    96.0
Name: 14317, dtype: object